{
  "books": [
    {
      "id": "1",
      "title": "The Alchemist",
      "author": "Paulo Coelho",
      "genre": "Fiction",
      "publishedYear": 1988,
      "publisher": "HarperOne",
      "language": "English",
      "pages": 208,
      "ISBN": "9780061122415",
      "format": ["Paperback", "Hardcover", "Ebook"],
      "price": 12.99,
      "rating": 4.7,
      "coverImage": "https://images.unsplash.com/photo-1544716278-ca5e3f4abd8c",
      "description": "The Alchemist tells the story of Santiago, a young shepherd who dreams of discovering a treasure beyond his homeland. Driven by curiosity and faith, he embarks on a journey across deserts and unfamiliar lands. Along the way, he meets mentors, mystics, and challenges that shape his understanding of life. The novel explores the idea of following one’s dreams, known as a Personal Legend. It emphasizes listening to the heart and trusting intuition. Themes of destiny, spirituality, and self-discovery are woven throughout the story. The narrative is simple yet deeply philosophical. Readers are encouraged to reflect on their own goals and fears. The book highlights the importance of perseverance and courage. It teaches that the journey itself holds the greatest treasure.",
      "createdAt": "2024-11-10T10:30:00Z"
    },
    {
      "id": "2",
      "title": "Atomic Habits",
      "author": "James Clear",
      "genre": "Self-Help",
      "publishedYear": 2018,
      "publisher": "Avery",
      "language": "English",
      "pages": 320,
      "ISBN": "9780735211292",
      "format": ["Paperback", "Hardcover", "Audiobook"],
      "price": 16.50,
      "rating": 4.8,
      "coverImage": "https://images.unsplash.com/photo-1512820790803-83ca734da794",
      "description": "Atomic Habits focuses on the power of small, consistent actions to create remarkable results. James Clear explains how habits shape identity and long-term success. The book introduces a practical framework for building good habits and breaking bad ones. Readers learn how tiny improvements compound over time. The author uses real-life examples and scientific research to support his ideas. Concepts like habit stacking and environment design are explained clearly. The writing style is simple and engaging. The book emphasizes systems over goals for sustainable change. It helps readers regain control over their routines. Atomic Habits is a practical guide for personal and professional growth.",
      "createdAt": "2024-11-12T14:15:00Z"
    },
    {
      "id": "3",
      "title": "1984",
      "author": "George Orwell",
      "genre": "Dystopian",
      "publishedYear": 1949,
      "publisher": "Secker & Warburg",
      "language": "English",
      "pages": 328,
      "ISBN": "9780451524935",
      "format": ["Paperback", "Hardcover", "Ebook"],
      "price": 9.99,
      "rating": 4.7,
      "coverImage": "https://images.unsplash.com/photo-1495446815901-a7297e633e8d",
      "description": "1984 presents a haunting vision of a future ruled by a totalitarian regime. The story follows Winston Smith, a man struggling against an oppressive government. Surveillance dominates every aspect of life through Big Brother. Truth is manipulated, and independent thought is considered a crime. The novel explores themes of freedom, control, and psychological manipulation. Orwell highlights the dangers of unchecked political power. Language is used as a tool to limit thinking and expression. The atmosphere is dark and unsettling. The story raises questions about individuality and resistance. Even decades later, the themes remain deeply relevant. Readers are challenged to consider their own freedom and societal influence.",
      "createdAt": "2024-11-14T09:00:00Z"
    },
    {
      "id": "4",
      "title": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "genre": "Classic",
      "publishedYear": 1960,
      "publisher": "J.B. Lippincott & Co.",
      "language": "English",
      "pages": 281,
      "ISBN": "9780061120084",
      "format": ["Paperback", "Hardcover"],
      "price": 10.99,
      "rating": 4.9,
      "coverImage": "https://images.unsplash.com/photo-1524995997946-a1c2e315a42f",
      "description": "To Kill a Mockingbird is a powerful story set in the American South during the 1930s. It is told through the eyes of Scout Finch, a young girl growing up in a divided society. Her father, Atticus Finch, defends a Black man falsely accused of a crime. The novel explores themes of racial injustice and moral integrity. Childhood innocence contrasts sharply with societal prejudice. The story emphasizes empathy and understanding others’ perspectives. Harper Lee’s writing is emotional and thoughtful. The characters feel deeply human and relatable. The novel encourages standing up for what is right. It remains one of the most important works in American literature. It teaches readers about courage, morality, and compassion in difficult times.",
      "createdAt": "2024-11-15T09:45:00Z"
    },
    {
      "id": "5",
      "title": "The Pragmatic Programmer",
      "author": "Andrew Hunt, David Thomas",
      "genre": "Programming",
      "publishedYear": 1999,
      "publisher": "Addison-Wesley",
      "language": "English",
      "pages": 352,
      "ISBN": "9780201616224",
      "format": ["Paperback", "Ebook"],
      "price": 29.99,
      "rating": 4.6,
      "coverImage": "https://images.unsplash.com/photo-1517433456452-f9633a875f6f",
      "description": "The Pragmatic Programmer is a foundational book for software developers at any level. It focuses on practical approaches to writing clean and maintainable code. The authors emphasize responsibility, adaptability, and continuous learning. Real-world examples illustrate common programming challenges. The book encourages thinking beyond specific languages or tools. Topics include debugging, testing, and software design principles. It promotes craftsmanship and professionalism in development. The advice is timeless and applicable across technologies. Developers gain insight into long-term career growth. This book remains a must-read in the programming world. It is both practical and inspiring, helping programmers think critically about their work.",
      "createdAt": "2024-11-18T11:20:00Z"
    },
    {
      "id": "6",
      "title": "Clean Code",
      "author": "Robert C. Martin",
      "genre": "Programming",
      "publishedYear": 2008,
      "publisher": "Prentice Hall",
      "language": "English",
      "pages": 464,
      "ISBN": "9780132350884",
      "format": ["Paperback", "Ebook"],
      "price": 34.99,
      "rating": 4.8,
      "coverImage": "https://images.unsplash.com/photo-1507721999472-8ed4421c4af2?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "description": "Clean Code emphasizes the importance of writing readable, efficient, and maintainable code. The book provides practical examples of bad code and demonstrates how to refactor it. It covers functions, classes, error handling, and testing. The author emphasizes the responsibility of developers to write code that others can understand. Principles of software craftsmanship are discussed. The book is rich in real-world examples. Readers learn how small habits impact code quality. It teaches critical thinking about design decisions. The book stresses continuous learning and adaptation. Clean Code is essential for both new and experienced developers.",
      "createdAt": "2024-11-19T10:00:00Z"
    },
    {
      "id": "7",
      "title": "Rich Dad Poor Dad",
      "author": "Robert Kiyosaki",
      "genre": "Finance",
      "publishedYear": 1997,
      "publisher": "Warner Books",
      "language": "English",
      "pages": 336,
      "ISBN": "9781612680194",
      "format": ["Paperback", "Audiobook"],
      "price": 14.99,
      "rating": 4.5,
      "coverImage": "https://images.unsplash.com/photo-1553729459-efe14ef6055d",
      "description": "Rich Dad Poor Dad contrasts two approaches to money and life. One father believes in traditional education and job security, while the other teaches entrepreneurship and financial independence. The book provides lessons on investing, managing money, and creating passive income. It challenges conventional ideas about wealth. Readers learn the importance of financial literacy and thinking differently. Concepts are explained with simple, relatable examples. The book emphasizes long-term planning and smart risk-taking. It encourages readers to overcome fear and pursue financial goals. Stories of success and failure illustrate key lessons. The writing is motivational and practical, helping readers transform their financial mindset.",
      "createdAt": "2024-11-20T09:30:00Z"
    },
    {
      "id": "8",
      "title": "The Psychology of Money",
      "author": "Morgan Housel",
      "genre": "Finance",
      "publishedYear": 2020,
      "publisher": "Harriman House",
      "language": "English",
      "pages": 256,
      "ISBN": "9780857197689",
      "format": ["Paperback", "Ebook", "Audiobook"],
      "price": 18.99,
      "rating": 4.7,
      "coverImage": "https://images.unsplash.com/photo-1457694587812-e8bf29a43845",
      "description": "The Psychology of Money explores the emotional and psychological aspects of wealth. Housel explains how behavior, luck, and patience affect financial success. Readers learn that good money management often depends more on behavior than knowledge. The book shares stories from history, business, and personal finance. Lessons are practical and widely applicable. It emphasizes long-term thinking and avoiding common cognitive biases. The writing style is clear and engaging. Readers are encouraged to reflect on their own money habits. The book provides insight into risk management and decision-making. It highlights the value of humility, patience, and flexibility. This is an essential read for anyone seeking financial wisdom.",
      "createdAt": "2024-11-21T12:00:00Z"
    },
    {
      "id": "9",
      "title": "Harry Potter and the Sorcerer’s Stone",
      "author": "J.K. Rowling",
      "genre": "Fantasy",
      "publishedYear": 1997,
      "publisher": "Bloomsbury",
      "language": "English",
      "pages": 309,
      "ISBN": "9780747532699",
      "format": ["Paperback", "Hardcover", "Ebook"],
      "price": 11.99,
      "rating": 4.9,
      "coverImage": "https://images.unsplash.com/photo-1543002588-bfa74002ed7e",
      "description": "Harry Potter and the Sorcerer’s Stone introduces readers to a magical world full of wonder, adventure, and friendship. Harry discovers he is a wizard on his eleventh birthday and attends Hogwarts School of Witchcraft and Wizardry. He meets friends, faces challenges, and learns the value of courage and loyalty. The story explores themes of identity, morality, and bravery. Rowling’s writing captivates both children and adults. Magical creatures, spells, and enchanting settings create an immersive experience. Readers follow Harry as he confronts evil forces and uncovers secrets about his past. The novel emphasizes the importance of choices and personal growth. It is the start of a beloved series that has influenced generations.",
      "createdAt": "2024-11-22T13:00:00Z"
    },
    {
      "id": "10",
      "title": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "genre": "Fantasy",
      "publishedYear": 1937,
      "publisher": "George Allen & Unwin",
      "language": "English",
      "pages": 310,
      "ISBN": "9780618968633",
      "format": ["Paperback", "Hardcover", "Ebook"],
      "price": 13.99,
      "rating": 4.8,
      "coverImage": "https://images.unsplash.com/photo-1613575363165-5a67fadc017c?q=80&w=735&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "description": "The Hobbit follows Bilbo Baggins, a quiet hobbit who is thrust into an epic adventure with dwarves to reclaim treasure guarded by the dragon Smaug. The journey introduces him to magical creatures, perilous landscapes, and tests of courage and cleverness. Tolkien weaves a story full of imagination, friendship, and bravery. The novel emphasizes personal growth, moral choices, and heroism in unexpected places. Rich descriptions of Middle-earth immerse readers in a fantastical world. Humor and light-hearted moments balance suspenseful and dangerous events. Themes of greed, loyalty, and resilience are explored. Bilbo’s transformation from a timid hobbit to a courageous hero inspires readers. It is a timeless fantasy classic for all ages.",
      "createdAt": "2024-11-23T10:00:00Z"
    },
    {
      "id": "11",
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "author": "J.R.R. Tolkien",
      "genre": "Fantasy",
      "publishedYear": 1954,
      "publisher": "George Allen & Unwin",
      "language": "English",
      "pages": 423,
      "ISBN": "9780618574940",
      "format": ["Paperback", "Hardcover", "Ebook"],
      "price": 18.99,
      "rating": 4.9,
      "coverImage": "https://images.unsplash.com/photo-1503676260728-1c00da094a0b",
      "description": "The Fellowship of the Ring begins the epic journey of Frodo Baggins and the fellowship to destroy the One Ring. Middle-earth is richly detailed, with diverse cultures, landscapes, and histories. The story highlights courage, friendship, and sacrifice in the face of overwhelming evil. Each member of the fellowship faces personal challenges and moral dilemmas. Tolkien combines adventure, suspense, and intricate world-building. Themes of power, corruption, and hope are explored through the quest. The writing is poetic and immersive. Readers experience epic battles, hidden dangers, and the strength of unity. The novel sets the stage for the continuing saga of good versus evil. It is a cornerstone of modern fantasy literature.",
      "createdAt": "2024-11-24T11:15:00Z"
    },
    {
      "id": "12",
      "title": "Thinking, Fast and Slow",
      "author": "Daniel Kahneman",
      "genre": "Psychology",
      "publishedYear": 2011,
      "publisher": "Farrar, Straus and Giroux",
      "language": "English",
      "pages": 499,
      "ISBN": "9780374533557",
      "format": ["Paperback", "Hardcover", "Ebook"],
      "price": 19.99,
      "rating": 4.7,
      "coverImage": "https://images.unsplash.com/photo-1507842217343-583bb7270b66",
      "description": "Thinking, Fast and Slow explores the dual systems of thought: System 1, which is fast, intuitive, and emotional, and System 2, which is slow, deliberate, and logical. Kahneman explains how these systems shape judgments, decisions, and behavior. The book includes numerous experiments and examples from psychology and economics. Readers learn about cognitive biases, heuristics, and errors in decision-making. The writing is accessible, combining research insights with practical applications. It helps readers understand their own thinking processes. The book emphasizes self-awareness and critical thinking. Kahneman discusses risk perception, probability, and human judgment. It is a foundational text for anyone interested in human behavior and decision-making. The book encourages reflection on personal and professional choices.",
      "createdAt": "2024-11-25T12:00:00Z"
    },
    {
      "id": "13",
      "title": "Sapiens: A Brief History of Humankind",
      "author": "Yuval Noah Harari",
      "genre": "History",
      "publishedYear": 2011,
      "publisher": "Harper",
      "language": "English",
      "pages": 498,
      "ISBN": "9780062316097",
      "format": ["Paperback", "Hardcover", "Ebook", "Audiobook"],
      "price": 21.99,
      "rating": 4.8,
      "coverImage": "https://images.unsplash.com/photo-1728722946351-53f4a98b5d03?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "description": "Sapiens traces the history of Homo sapiens from the emergence of cognitive abilities to modern society. Harari examines how biology, culture, and technology shaped human societies. The book explores major revolutions including cognitive, agricultural, and scientific. It analyzes social hierarchies, religion, and economic systems. Readers gain insight into human behavior, cooperation, and conflict. The writing is engaging, combining narrative storytelling with factual analysis. Harari raises thought-provoking questions about the past, present, and future. The book highlights how shared beliefs have united or divided societies. It encourages reflection on humanity’s impact on the planet. Sapiens is both educational and deeply philosophical. It is a must-read for history and sociology enthusiasts.",
      "createdAt": "2024-11-26T09:30:00Z"
    },
    {
      "id": "14",
      "title": "Educated",
      "author": "Tara Westover",
      "genre": "Memoir",
      "publishedYear": 2018,
      "publisher": "Random House",
      "language": "English",
      "pages": 334,
      "ISBN": "9780399590504",
      "format": ["Paperback", "Hardcover", "Ebook"],
      "price": 15.99,
      "rating": 4.7,
      "coverImage": "https://images.unsplash.com/photo-1524253482453-3fed8d2fe12b",
      "description": "Educated is the memoir of Tara Westover, who grew up in a strict and abusive household in rural Idaho with little formal education. Through determination and self-learning, she escapes her oppressive environment and pursues higher education. The memoir explores family loyalty, personal growth, and the transformative power of knowledge. Westover shares the challenges of balancing identity and independence. Readers witness her struggle with self-discovery and overcoming fear. The writing is evocative, reflective, and emotionally impactful. Themes of resilience, courage, and intellectual freedom run throughout. Educated emphasizes the importance of education in shaping one’s future. It is a story of hope, determination, and the pursuit of truth. The memoir inspires readers to value knowledge and personal growth.",
      "createdAt": "2024-11-27T11:00:00Z"
    },
    {
      "id": "15",
      "title": "Becoming",
      "author": "Michelle Obama",
      "genre": "Memoir",
      "publishedYear": 2018,
      "publisher": "Crown",
      "language": "English",
      "pages": 448,
      "ISBN": "9781524763138",
      "format": ["Paperback", "Hardcover", "Ebook", "Audiobook"],
      "price": 17.99,
      "rating": 4.8,
      "coverImage": "https://images.unsplash.com/photo-1544716278-ca5e3f4abd8c",
      "description": "Becoming is the personal memoir of former First Lady Michelle Obama, detailing her life from childhood through her years in the White House. She shares stories of family, education, marriage, and motherhood. The book explores challenges, triumphs, and the journey to self-discovery. Obama reflects on identity, ambition, and public service. Readers gain insight into her values, determination, and resilience. The memoir is written with honesty, warmth, and inspiration. Themes of empowerment, social responsibility, and leadership are central. It emphasizes the importance of mentorship, community, and perseverance. Becoming encourages readers to embrace their own journey. The narrative blends personal anecdotes with universal life lessons. It is a celebration of growth, hope, and purpose.",
      "createdAt": "2024-11-28T10:30:00Z"
    },
    {
      "id": "16",
      "title": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "genre": "Classic",
      "publishedYear": 1951,
      "publisher": "Little, Brown and Company",
      "language": "English",
      "pages": 277,
      "ISBN": "9780316769488",
      "format": ["Paperback", "Hardcover", "Ebook"],
      "price": 10.99,
      "rating": 4.5,
      "coverImage": "https://images.unsplash.com/photo-1544716278-ca5e3f4abd8c",
      "description": "The Catcher in the Rye follows the story of Holden Caulfield, a teenager navigating the challenges of adolescence in New York City. The novel captures his alienation, rebellion, and search for authenticity. Salinger explores themes of identity, innocence, and the struggle to connect with society. Readers witness Holden’s critical observations of the world around him. The narrative is in first-person, providing a deep psychological insight. The book is both humorous and poignant, revealing the complexities of growing up. Holden’s journey reflects universal struggles of adolescence and self-discovery. The story emphasizes compassion, understanding, and the importance of human connection. It has become a classic coming-of-age novel for generations. The novel resonates with anyone navigating the transition to adulthood.",
      "createdAt": "2024-11-29T12:00:00Z"
    },
    {
      "id": "17",
      "title": "Meditations",
      "author": "Marcus Aurelius",
      "genre": "Philosophy",
      "publishedYear": 180,
      "publisher": "Penguin Classics",
      "language": "English",
      "pages": 304,
      "ISBN": "9780140449334",
      "format": ["Paperback", "Hardcover", "Ebook"],
      "price": 12.50,
      "rating": 4.8,
      "coverImage": "https://images.unsplash.com/photo-1553729459-efe14ef6055d",
      "description": "Meditations is a series of personal writings by Roman Emperor Marcus Aurelius reflecting on life, morality, and leadership. The book provides insight into Stoic philosophy and practical guidance on self-discipline, resilience, and virtue. Aurelius emphasizes the importance of reason, perspective, and mindfulness in daily life. Readers learn how to confront challenges with calm and clarity. The text explores the impermanence of life and the value of ethical behavior. His reflections encourage introspection and personal growth. Themes of humility, courage, and inner peace are central. The writing is concise yet profound, offering timeless wisdom. Meditations is both philosophical and practical, guiding readers toward a meaningful life. It has influenced thinkers, leaders, and readers for centuries.",
      "createdAt": "2024-11-30T09:30:00Z"
    },
    {
      "id": "18",
      "title": "Thinking in Bets",
      "author": "Annie Duke",
      "genre": "Self-Help",
      "publishedYear": 2018,
      "publisher": "Portfolio",
      "language": "English",
      "pages": 288,
      "ISBN": "9780735216358",
      "format": ["Paperback", "Hardcover", "Ebook"],
      "price": 17.50,
      "rating": 4.6,
      "coverImage": "https://images.unsplash.com/photo-1619646286047-c6681c24a695?q=80&w=1170&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "description": "Thinking in Bets explores decision-making under uncertainty and risk, using strategies from poker and psychology. Annie Duke emphasizes probabilistic thinking and managing cognitive biases to make better decisions. The book includes real-life examples from business, sports, and personal life. Readers learn to evaluate outcomes rather than focusing solely on results. It encourages embracing uncertainty and using feedback to improve judgment. The narrative is engaging and full of practical advice. The book discusses the value of humility, curiosity, and learning from mistakes. It teaches critical thinking and emotional control in decision-making. Readers are encouraged to question assumptions and consider probabilities. Thinking in Bets is a guide for smarter choices and better long-term outcomes. It combines psychology, strategy, and practical insights.",
      "createdAt": "2024-12-01T11:00:00Z"
    },
    {
      "id": "19",
      "title": "The Four Agreements",
      "author": "Don Miguel Ruiz",
      "genre": "Self-Help",
      "publishedYear": 1997,
      "publisher": "Amber-Allen Publishing",
      "language": "English",
      "pages": 160,
      "ISBN": "9781878424310",
      "format": ["Paperback", "Ebook", "Audiobook"],
      "price": 9.99,
      "rating": 4.7,
      "coverImage": "https://images.unsplash.com/photo-1507842217343-583bb7270b66",
      "description": "The Four Agreements presents a practical guide to personal freedom and self-awareness, based on ancient Toltec wisdom. Don Miguel Ruiz explains four principles to live by: be impeccable with your word, don’t take anything personally, don’t make assumptions, and always do your best. The book teaches how to break self-limiting beliefs and cultivate a fulfilling life. Readers learn to take responsibility for their thoughts, emotions, and actions. The writing is simple, clear, and inspirational. It combines spiritual insight with practical guidance. Themes of love, forgiveness, and mindfulness are explored. The book encourages reflection and conscious living. It has transformed the lives of readers worldwide. It is a concise, yet deeply meaningful, self-help classic.",
      "createdAt": "2024-12-02T10:00:00Z"
    },
    {
      "id": "20",
      "title": "The Power of Habit",
      "author": "Charles Duhigg",
      "genre": "Self-Help",
      "publishedYear": 2012,
      "publisher": "Random House",
      "language": "English",
      "pages": 371,
      "ISBN": "9780812981605",
      "format": ["Paperback", "Hardcover", "Ebook", "Audiobook"],
      "price": 16.99,
      "rating": 4.7,
      "coverImage": "https://images.unsplash.com/photo-1512820790803-83ca734da794",
      "description": "The Power of Habit explores the science behind why habits exist and how they can be changed. Charles Duhigg examines the habit loop of cue, routine, and reward, and explains how habits impact individuals, organizations, and societies. Readers learn strategies for forming good habits and breaking bad ones. The book combines neuroscience, psychology, and real-world examples. It emphasizes self-awareness, motivation, and discipline. Case studies from business, sports, and personal life illustrate key concepts. The writing is engaging and accessible. The book provides practical steps for lasting change. It inspires readers to take control of their behaviors and improve productivity. Habits are framed as powerful tools that shape success and personal growth.",
      "createdAt": "2024-12-03T12:00:00Z"
    }
  ]
}

